Revit 2027 API
ControlledApplication Properties
The ControlledApplication type exposes the following members.
Properties
Name | Description
ActiveAddInId | Retrieves the Id of the currently running external application.
AllUsersAddinsLocation |  The folder location for .addin files for all users.
Cities | Returns a set of all the known city locations within Revit.
Create | Provides an object that can be used to create new instances of Autodesk Revit API objects.
CurrentUserAddinsLocation |  The folder location for .addin files for the current user.
CurrentUsersAddinsDataFolderPath |  Path to AddinsData folder for the current user.
CurrentUsersDataFolderPath |  Path to data folder for the current user.
IsLateAddinLoading |  Indicates whether this add-in is loaded on the fly or not. If it is loaded when is Revit starting up, it is false, otherwise it should be true.
Language | The language used in the current session of Revit.
Product |  The product type for the current session of Revit.
RecordingJournalFilename |  Retrieve the name of the journal file the Revit is currently recording to.
SharedComponentsLocation |  Location of shared components used by Revit.
SharedParametersFilename | Contains the fully qualified path to a shared parameters file.
SubVersionNumber |  The minor version number of Revit
VersionBuild |  Returns the internal build number of the Autodesk Revit application.
VersionName |  Returns the name of the Revit application.
VersionNumber |  Return the primary version of the Revit application.
Top
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace